[
  {
    "title": "Foreigner's Guide to Buying Property in Mexico City (2026)",
    "slug": "buying-property-mexico-city-foreigner",
    "date": "January 15, 2026",
    "excerpt": "Direct ownership is possible. A comprehensive guide to the 'Restricted Zone', SRE permits, and why CDMX is easier than the coast.",
    "content": "<p>Mexico City has become a prime destination for American citizens seeking investment and lifestyle opportunities. A common misconception is that foreigners cannot own land in Mexico. This is false. The 'Restricted Zone' applies only to borders and coastlines.</p><h3>Direct Ownership vs. Fideicomiso</h3><p>Because Mexico City is inland, American citizens can hold <strong>Direct Deed (Escritura)</strong> to property, exactly like a Mexican citizen. You do NOT need a bank trust (Fideicomiso) here, which saves significantly on annual fees.</p><h3>The SRE Permit</h3><p>You will, however, need a permit from the Ministry of Foreign Affairs (SRE). This includes the 'Cláusula Calvo', where you agree to be treated as a national regarding your property rights. It is a standard formality handled by your Notario.</p>",
    "related_location": "polanco",
    "image": "../img/locations/polanco-hero.png"
  },
  {
    "title": "The Hidden Costs of Buying in CDMX: Taxes & Fees",
    "slug": "cost-of-buying-property-cdmx",
    "date": "January 22, 2026",
    "excerpt": "Don't get blindsided by the closing costs. A breakdown of ISAI, Notary fees, and why property taxes are surprisingly low.",
    "content": "<p>While property prices in CDMX are attractive compared to NYC or LA, the 'Closing Costs' can be a shock. In the US, closing costs might be 1-2%. In Mexico City, budget for <strong>5-8%</strong> of the purchase price.</p><h3>The Breakdown</h3><ul><li><strong>ISAI (Acquisition Tax):</strong> The big one. Roughly 3-5% of the value.</li><li><strong>Notary Fees:</strong> 1-2%. Remember, the Mexican Notario is a high-level legal official, not just a witness.</li><li><strong>Legal Fees:</strong> $1,000 - $3,000 USD for due diligence.</li></ul><h3>The Good News: Predial</h3><p>Annual property tax (Predial) is incredibly low—typically 0.1% to 0.4% of the cadastral value.</p>",
    "related_location": "santa-fe",
    "image": "../img/locations/santa-fe-hero.png"
  },
  {
    "title": "Renovating in Mexico City: Architects & Permits",
    "slug": "renovating-property-mexico-city",
    "date": "February 2, 2026",
    "excerpt": "Navigating SEDUVI, finding a DRO, and why you need a local architect even if you have a US license.",
    "content": "<p>Renovating a Porfirian mansion or a mid-century apartment is the dream. But the bureaucracy is real. The Secretaría de Desarrollo Urbano y Vivienda (SEDUVI) oversees all permits.</p><h3>The Role of the DRO</h3><p>You need a 'Director Responsable de Obra' (DRO)—a certified engineer/architect liable for the safety of the project. Your US architect cannot sign off on plans here.</p><h3>Finding Talent</h3><p>While sites like Upwork exist, high-end renovation requires a studio with local presence and connections to vetted contractors. Always ask for the architect's 'Cédula Profesional' (license).</p>",
    "related_location": "roma-norte",
    "image": "../img/locations/roma-norte-hero.png"
  },
  {
    "title": "Navigating Heritage Zoning in Roma Norte",
    "slug": "heritage-zoning-roma-norte",
    "date": "October 12, 2025",
    "excerpt": "Why INBA protection isn't a death sentence for your renovation project. A guide to adaptive reuse in Catalogued properties.",
    "content": "<p>Roma Norte is defined by its architectural heritage. But for investors, the 'Catalogued Property' designation can feel like a red flag. It shouldn't.</p><h3>Understanding INBA vs. SEDUVI</h3><p>The first step is distinguishing between artistic value (INBA) and urban value (SEDUVI). INBA cares about the facade and historical fabric; SEDUVI cares about usage and density.</p><h3>The Strategy: Invisible Intervention</h3><p>Our approach at Talacha is to restore the facade to museum quality while modernizing the core. We use steel framing to reinforce the structure internally, allowing for open-plan layouts without touching the historic masonry.</p>",
    "related_location": "roma-norte",
    "image": "../img/locations/roma-norte-detail.png"
  },
  {
    "title": "Seismic Safety: What Every Investor Needs to Know",
    "slug": "seismic-safety-guide",
    "date": "September 28, 2025",
    "excerpt": "The 2026 Building Code update changed everything. How to ensure your Juarez or Roma investment is earthquake-proof.",
    "content": "<p>Mexico City is a seismic zone. There is no getting around it. But the risk is not uniform. The 'Lakebed Zone' (Roma, Juarez, Condesa) amplifies waves, while the 'Hill Zone' (Lomas, Pedregal) is rock solid.</p><h3>The Retrofit Imperative</h3><p>Buying a 1900s mansion in Juarez? It likely needs a structural retrofit. We partner with top engineers to install viscous dampers or shear walls. This isn't just about safety; it's about asset value. A certified seismic-safe building commands a 15% premium.</p>",
    "related_location": "juarez",
    "image": "../img/locations/juarez-detail.png"
  },
  {
    "title": "The ROI of Rooftops in Condesa",
    "slug": "condesa-rooftop-roi",
    "date": "November 5, 2025",
    "excerpt": "You can't build up, but you can build out. How activating the roof adds 30% to your property value.",
    "content": "<p>In Condesa, zoning laws strictly limit building heights to preserve the Art Deco scale. This makes the roof the most valuable underutilized asset in the neighborhood.</p><h3>The Legal Path</h3><p>While you often cannot add a 'structure' (walls and roof), you can add a 'light structure' (pergola) and decking. By turning a tar-paper roof into a lush garden with a wet bar, you effectively add a second living room.</p>",
    "related_location": "condesa",
    "image": "../img/locations/condesa-lifestyle.png"
  }
]