{
  "services": [
    {
      "name": "Architects",
      "slug": "architects",
      "h1_prefix": "English-Speaking Architects:",
      "intro": "Translating international vision into local reality. We are the bridge between your design aspirations and the complex regulatory environment of {{location_name}}.",
      "meta_desc_prefix": "Premier English-speaking architects serving"
    },
    {
      "name": "Residential Architects",
      "slug": "residential-architects",
      "h1_prefix": "Residential Design Studio:",
      "intro": "Your home in {{location_name}} should be a sanctuary. We specialize in navigating local constraints to build modern, light-filled residences.",
      "meta_desc_prefix": "Luxury residential architects for homes in"
    },
    {
      "name": "Commercial Architects",
      "slug": "commercial-architects",
      "h1_prefix": "Commercial Architecture:",
      "intro": "From boutique retail to corporate HQs. We design high-performance spaces in {{location_name}} that elevate your brand and workflow.",
      "meta_desc_prefix": "Commercial architects for office and retail in"
    },
    {
      "name": "Renovation Contractors",
      "slug": "renovation-contractors",
      "h1_prefix": "Renovation & Construction:",
      "intro": "Turnkey renovation services for {{location_name}}. We manage the permits, the timeline, and the quality—so you don't have to.",
      "meta_desc_prefix": "Trusted renovation contractors for properties in"
    },
    {
      "name": "Interior Design",
      "slug": "interior-design",
      "h1_prefix": "Interior Design Studio:",
      "intro": "Bringing the warmth of Mexican materials to modern interiors. Our design team curates furniture, lighting, and finishes for {{location_name}} spaces.",
      "meta_desc_prefix": "Interior design services for luxury spaces in"
    }
  ],
  "locations": [
    {
      "name": "Polanco",
      "slug": "polanco",
      "vibe": "The 'Beverly Hills of Mexico City.' Polanco is synonymous with luxury, safety, and high-end living. It is the preferred district for diplomats, international executives, and the city's elite.",
      "lifestyle_vibe": "Living in Polanco offers a lifestyle comparable to the Upper East Side in New York or Mayfair in London, but with a distinctly Mexican warmth. The daily rhythm here is defined by walkability and high-end convenience. Residents start their mornings with a run in Parque Lincoln or a pilates class on Horacio, followed by breakfast at Eno or Catamundi. Unlike other luxury zones like Lomas (which are car-dependent), Polanco allows you to live a pedestrian life. You can walk to your office, to the city's best museums (Soumaya and Jumex), and to dinner at world-ranking restaurants like Pujol or Quintonil. The streets are patrolled by private security, making it one of the safest zones in Latin America. Weekends are social affairs, with families gathering in the parks and the 'Polanquito' zone turning into a vibrant, open-air social club where business deals are closed over carajillos. The demographics are heavily skewed towards expats and the Mexican upper class, creating a unique bubble where English and French are heard as often as Spanish. It is a neighborhood that demands a certain level of polish; people dress up to go to the supermarket here.",
      "history": "Polanco's origins trace back to the Hacienda de San Juan de los Morales, a vast estate granted to Hernán Cortés in the 16th century. However, its modern identity began in the 1930s when it was subdivided for the city's emerging upper class. The original architectural vision was 'California Colonial'—vast houses with red tile roofs and intricate ironwork—mixed with the 'International Style' of the mid-20th century. While many original mansions have been replaced by luxury apartment blocks, the neighborhood retains its strict grid and wide, tree-lined avenues named after philosophers and writers (Masaryk, Dickens, Moliere). This intellectual naming convention hints at the area's initial aspiration to be a center of culture and refinement, a promise it fulfills today with its concentration of galleries and museums. The transformation from a residential suburb to a high-density luxury commercial hub occurred in the 1980s and 90s, but strict zoning laws introduced in the 2000s have successfully preserved its residential core.",
      "landmarks": "Museo Soumaya (Carlos Slim's distinct anvil-shaped museum), Museo Jumex (Contemporary Art), Parque Lincoln (the neighborhood's heart), Avenida Presidente Masaryk (Latin America's most expensive retail street).",
      "best_coffee": "Catamundi (for the donuts and ambiance) or Eno (chef Enrique Olvera's casual spot).",
      "dining_scene": "World-class. From the molecular gastronomy of Pujol (often voted best in North America) to the Basque excellence of Biko. For casual dining, 'Polanquito' offers dense blocks of high-end steakhouses, French bistros, and seafood bars.",
      "quirks": "The 'Polanco Bubble' is real. Many residents joke that they never leave the neighborhood because everything—from top schools to top hospitals—is within a 2km radius.",
      "investment_outlook": "Polanco is the 'blue chip' stock of Mexico City real estate. It offers the highest capital security and liquidity. While the entry price is high ($600k USD+ for a 2-bedroom), the demand is inelastic. It is the first choice for multinational executives, diplomats, and wealthy nationals. Buying here is a defensive play against inflation and currency fluctuation. Appreciation is steady, driven by the absolute scarcity of buildable land. Unlike emerging neighborhoods where value is speculative, Polanco's value is established and protected by zoning laws that prevent over-development. It is the closest thing to a 'safe haven' asset in the Mexican property market.",
      "challenge": "Navigating the 'Programa Parcial' zoning laws which strictly limit height and density to preserve the area's character.",
      "solution": "We have specific experience with SEDUVI Polanco permits to maximize square footage within legal limits.",
      "focus_areas": ["Luxury Apartments", "Retail Boutiques", "Consulate Renovations"],
      "zoning_authority": "SEDUVI & Miguel Hidalgo",
      "permit_timeline": "4-6 Months",
      "cost_per_sqm": "$2,500 - $4,000 USD",
      "best_streets": ["Campos Elíseos", "Rubén Darío", "Tres Picos"],
      "hidden_gems": "Polanco V Sección offers a much quieter, greener, and more residential feel while still being minutes from Masaryk.",
      "investor_tip": "Look for 1970s and 80s apartment buildings with 'good bones' (high ceilings, large windows) that have not been renovated. A gut renovation here yields the highest ROI because buyers pay a premium for turnkey modern luxury in older, spacious shells.",
      "common_project_type": "Gut renovation of 200sqm+ apartments, opening up closed kitchens and modernizing bathrooms.",
      "nearby": [
        {"name": "Lomas de Chapultepec", "slug": "lomas-de-chapultepec"},
        {"name": "Condesa", "slug": "condesa"}
      ]
    },
    {
      "name": "Condesa",
      "slug": "condesa",
      "vibe": "Bohemian chic meets Art Deco elegance. Condesa is the leafy, walkable heart of the city's creative class.",
      "lifestyle_vibe": "Condesa feels like a village within the metropolis. The lifestyle is defined by its two parks—Parque México and Parque España. Mornings are for walking dogs on the Amsterdam oval; evenings are for mezcal on rooftop terraces. It draws a younger, artistic, and expat-heavy crowd. It is arguably the most walkable and bicycle-friendly zone in the city. The vibe is younger and more creative than Polanco. You'll see architects, designers, and writers working from terraces. The nightlife is vibrant but laid back, focused on mezcal bars, jazz clubs, and rooftop lounges rather than mega-clubs. It has a European sensibility, reminiscent of Paris or Barcelona, where life is lived on the sidewalk. The sense of community is strong here; neighbors know each other, and local businesses are cherished.",
      "history": "Condesa's unique layout comes from its past as a horse racing track (the Hipódromo) in the early 1900s. When the track closed, the oval became Amsterdam Avenue, and the area was developed with a heavy Art Deco influence. In the 1930s and 40s, it was the preferred neighborhood for the artistic middle class. After a decline in the late 20th century, it experienced a massive renaissance in the 2000s, becoming the epicenter of the city's culinary and design boom. Today, it has one of the highest concentrations of Art Deco architecture in the world, rivaling Miami Beach. This architectural heritage is fiercely protected, giving the neighborhood a timeless, cinematic quality.",
      "landmarks": "Parque México (with its iconic Art Deco clock tower), The Amsterdam Oval (Avenida Amsterdam), Edificio Basurto (an Art Deco masterpiece).",
      "best_coffee": "Chiquitito Café (tiny, perfectionist) or Blend Station (for digital nomads).",
      "dining_scene": "Casual, trendy, and sidewalk-focused. Endless brunch spots, wine bars, and fusion tacos.",
      "quirks": "The sound of dogs barking is the neighborhood soundtrack. It is arguably the most dog-friendly zone in Latin America.",
      "investment_outlook": "Condesa is the darling of the short-term rental market (Airbnb). Tourists love it for its walkability and 'vibes.' Consequently, per-night rates rival hotels. For long-term holding, property values have surged, but demand remains incredibly strong due to the lifestyle factor. It is less volatile than emerging zones but offers higher yields than Polanco due to the tourism factor. However, prices per square meter for renovated Art Deco units are now approaching Polanco levels, indicating its solidified status as a prime asset class.",
      "challenge": "Strict heritage protections (INBA) on Art Deco facades make exterior modifications difficult.",
      "solution": "We specialize in 'invisible' modernizations—restoring the facade perfectly while completely overhauling the interior systems.",
      "focus_areas": ["Art Deco Restoration", "Restaurant Build-outs", "Rooftop Terraces"],
      "zoning_authority": "INBA (Heritage)",
      "permit_timeline": "5-8 Months",
      "cost_per_sqm": "$1,800 - $3,000 USD",
      "best_streets": ["Amsterdam", "Veracruz", "Mazatlán"],
      "hidden_gems": "The streets bordering San Miguel Chapultepec offer better value.",
      "investor_tip": "The Roof is the Asset. Due to heritage rules, you can't build up, but you can often activate the roof. A private roof garden adds 30-40% to the rental or resale value.",
      "common_project_type": "Converting ground-floor residential units into boutique retail or cafes.",
      "nearby": [
        {"name": "Roma Norte", "slug": "roma-norte"},
        {"name": "Polanco", "slug": "polanco"},
        {"name": "Roma Sur", "slug": "roma-sur"}
      ]
    },
    {
      "name": "Roma Norte",
      "slug": "roma-norte",
      "vibe": "The hipster capital. Edgy, artistic, and bursting with culinary innovation. It is the epicenter of gentrification and cool.",
      "lifestyle_vibe": "Roma Norte is kinetic. It feels like Brooklyn's Williamsburg or Berlin's Kreuzberg, but with a distinctly Mexican chaotic charm. The streets are a mix of crumbling 1900s mansions, sleek modern lofts, and street art. The lifestyle is social and culinary. This is where the best chefs open their experimental concepts. It attracts a heavy concentration of digital nomads, startup founders, and the creative class. Life happens on the street here—in the plazas (Rio de Janeiro, Luis Cabrera) and on the medians of Alvaro Obregón. It is louder and busier than Condesa, but offers a more intense cultural experience. The energy is youthful and progressive, making it the preferred landing spot for young expats and creatives moving to the city.",
      "history": "Developed during the regime of Porfirio Díaz (late 19th century) as an aristocratic enclave, Roma features French-style mansions and wide boulevards. It fell into disrepair after the 1985 earthquake but has been spectacularly reborn in the last 15 years. Alfonso Cuarón's movie 'Roma' captures its 1970s era, but today it is fully gentrified and serves as the cultural heart of the modern city. The juxtaposition of Beaux-Arts mansions with modern street art and industrial lofts tells the story of a neighborhood that honors its past while aggressively inventing its future.",
      "landmarks": "Plaza Río de Janeiro, Casa Lamm, Mercado Roma.",
      "best_coffee": "Panadería Rosetta (famous for guava rolls) or Buna (science-focused coffee).",
      "dining_scene": "The best in the country. From street food to the World's 50 Best (Rosetta, Máximo Bistrot).",
      "quirks": "The 'Roma Aesthetic' celebrates decay. Peeling paint and exposed brick are design choices here.",
      "investment_outlook": "Explosive growth. It is the top destination for digital nomads. Commercial real estate here commands a massive premium. Residential appreciation has been massive. It is the #1 destination for foreign remote workers, ensuring high occupancy for rentals. While some argue it is nearing a price ceiling, the constant influx of international demand suggests continued growth, especially for unique, design-forward properties that stand out in the crowded Airbnb market.",
      "challenge": "Catalogued properties (INBA) are everywhere. Also, the soil here is softer (lakebed), so seismic retrofitting is critical.",
      "solution": "We are experts in seismic structural reinforcement that respects heritage architecture.",
      "focus_areas": ["Adaptive Reuse", "Heritage Mansions", "Creative Offices"],
      "zoning_authority": "INBA & SEDUVI",
      "permit_timeline": "6-9 Months",
      "cost_per_sqm": "$2,000 - $3,500 USD",
      "best_streets": ["Colima", "Orizaba", "Tabasco"],
      "hidden_gems": "The zone near Insurgentes and Chapultepec is chaotic but rapidly improving.",
      "investor_tip": "Look for 'Infill' opportunities—ugly 1980s buildings nestled between historic mansions. These have no heritage protection, meaning you can demolish or radically alter them.",
      "common_project_type": "Adaptive reuse: Turning a large Porfirian house into a mixed-use complex.",
      "nearby": [
        {"name": "Roma Sur", "slug": "roma-sur"},
        {"name": "Condesa", "slug": "condesa"},
        {"name": "Juárez", "slug": "juarez"}
      ]
    },
    {
      "name": "Roma Sur",
      "slug": "roma-sur",
      "vibe": "The authentic, quiet alternative. Roma Sur retains the neighborhood feel that Norte has lost to tourism.",
      "lifestyle_vibe": "If Roma Norte is for partying, Roma Sur is for living. It feels like the Mexico City of 20 years ago—traditional, neighborly, and slow-paced. It is quieter, greener, and significantly more residential. The lifestyle is about local markets (Mercado de Medellín) and home cooking. Residents here are a mix of original families who have lived here for generations and young professionals seeking the Roma location without the Norte noise. You will find 'Tienditas' (corner stores) run by the same families for decades. It is becoming the refuge for those who love the aesthetic of the area but prioritize sleep and community over nightlife. The connectivity is excellent, with easy access to the Metrobus and major avenues, making it a practical choice for commuters.",
      "history": "Developed slightly later than the Norte, Roma Sur features a mix of Art Deco, Californian Colonial, and Mid-Century Functionalist architecture. It was traditionally a middle-class stronghold and has resisted the extreme commercialization of its northern neighbor. The urban layout is similar—a grid of tree-lined streets—but the density is lower, with more single-family homes remaining intact rather than being converted into apartment blocks.",
      "landmarks": "Mercado de Medellín, Huerto Roma Verde.",
      "best_coffee": "Vocablo Café.",
      "dining_scene": "Traditional Cantinas and emerging neighborhood bistros.",
      "quirks": "The streets are named after cities and states of Mexico (Tlaxcala, Bajío, Aguascalientes).",
      "investment_outlook": "Roma Sur is the 'Value Play.' Prices are 20-30% lower than Norte, but the appreciation curve is steeper as demand spills over. It is poised for significant growth as the next logical step for gentrification. Investors who buy here are betting on the inevitable southward expansion of the 'cool' zone. It offers a better entry point for those priced out of Norte or Condesa, with arguably higher upside potential in the next 5-10 years.",
      "challenge": "Lot sizes are often smaller and layouts in 1950s houses can be compartmentalized and dark.",
      "solution": "Our design team specializes in 'Light Surgery'—strategic demolition of internal walls and adding skylights.",
      "focus_areas": ["Residential Renovations", "Family Home Expansions", "Sustainable Retrofits"],
      "zoning_authority": "SEDUVI",
      "permit_timeline": "3-5 Months",
      "cost_per_sqm": "$1,400 - $2,500 USD",
      "best_streets": ["Manzanillo", "Tlacoquemécatl", "Bajío"],
      "hidden_gems": "The properties abutting the Viaducto highway offer incredible value.",
      "investor_tip": "Buy single-family homes here. Adding a third story (studio/roof garden) is often permitted and creates massive equity.",
      "common_project_type": "Modernizing a mid-century single-family home for a young family.",
      "nearby": [
        {"name": "Roma Norte", "slug": "roma-norte"},
        {"name": "Del Valle", "slug": "del-valle"},
        {"name": "Narvarte", "slug": "narvarte"}
      ]
    },
    {
      "name": "Lomas de Chapultepec",
      "slug": "lomas-de-chapultepec",
      "vibe": "Fortress of solitude and wealth. Lomas is the home of the 1%. Huge estates, high walls, and total privacy.",
      "lifestyle_vibe": "Lomas is not a 'neighborhood' in the social sense; it is a collection of private compounds. It is car-dependent, quiet, and lushly green. The lifestyle is one of ultimate privacy and luxury. It attracts diplomats and captains of industry. Life happens behind the walls or at exclusive clubs like the Club de Golf Chapultepec. It offers the most square footage and privacy of any central zone. The streets are wide, winding, and lined with massive trees, giving it a suburban feel despite being minutes from the business district. It is the only place in the city where you can have a sprawling garden, a swimming pool, and a tennis court on your own property.",
      "history": "Established in the 1920s as 'Chapultepec Heights,' it was designed by British/American planners to mimic the 'Garden City' movement with winding streets. The intent was to create an exclusive enclave separated from the chaos of the city center. Over the decades, it has remained the address of choice for Mexico's political and economic elite. The architecture ranges from massive neo-colonial mansions to ultra-modern concrete masterpieces designed by the country's top architects.",
      "landmarks": "Corredor de las Lomas (Reforma office towers), Embassies.",
      "best_coffee": "Hidden gems in 'Prado Norte'.",
      "dining_scene": "Exclusive, discreet restaurants often hidden in commercial plazas.",
      "quirks": "The geography is confusing by design. The winding streets were meant to deter casual traffic.",
      "investment_outlook": "A fortress of value. Lomas real estate is virtually immune to market crashes. It holds value in USD terms better than any other zone. It is a generational asset class. While rental yields are lower (percentage-wise) due to the high asset value, the security of the principal is unmatched. It is where you park wealth to preserve it.",
      "challenge": "Strict density and usage rules. The 'Neighbors Associations' are powerful.",
      "solution": "We provide 'White Glove' project management and handle delicate neighbor relations.",
      "focus_areas": ["Luxury Estates", "Ground-up Construction", "Security Design"],
      "zoning_authority": "Miguel Hidalgo",
      "permit_timeline": "3-6 Months",
      "cost_per_sqm": "$2,500 - $5,000 USD",
      "best_streets": ["Paseo de la Reforma", "Virreyes", "Sierra Madre"],
      "hidden_gems": "Lomas Virreyes offers a slightly more accessible entry point.",
      "investor_tip": "Security is the ultimate amenity. Investing in a 'Safe Room' and perimeter technology adds dollar-for-dollar value.",
      "common_project_type": "Ground-up construction of a 1,000sqm+ luxury residence.",
      "nearby": [
        {"name": "Polanco", "slug": "polanco"},
        {"name": "Santa Fe", "slug": "santa-fe"}
      ]
    },
    {
      "name": "Santa Fe",
      "slug": "santa-fe",
      "vibe": "The Manhattan of Mexico. A skyline of glass and steel, monumental scale, and modern corporate power.",
      "lifestyle_vibe": "Santa Fe is a bubble of the First World. It feels like Houston or Miami. It is home to the city's largest shopping mall and its newest park (La Mexicana). Residents here value security, modernity, and amenities. It is the preferred zone for multinational families. You live in a high-rise with a gym, pool, and concierge. It is car-centric, though the new train will change that. The lifestyle is efficient and comfortable; you drive from your secure apartment to your secure office to the secure mall. It lacks the 'street life' of Roma or Condesa, but offers a level of infrastructure and safety that is hard to find elsewhere. For families with children attending the nearby international schools, it offers a suburban-style convenience in a vertical setting.",
      "history": "Originally a sand mine and landfill, Santa Fe was transformed in the 1990s into the most modern business district in Latin America. It is now the headquarters for most global corporations operating in Mexico. The rapid development outpaced the infrastructure, leading to legendary traffic jams, but recent improvements like the new bridges and the upcoming train line are alleviating this.",
      "landmarks": "Parque La Mexicana, The Garden Santa Fe.",
      "best_coffee": "Starbucks Reserve in La Mexicana.",
      "dining_scene": "High-end chains and steakhouses catering to business lunches.",
      "quirks": "It has its own micro-climate. It is significantly colder and windier than the rest of the city.",
      "investment_outlook": "Rental yields are strong due to the corporate workforce. The upcoming 'Tren Interurbano' will likely spike property values. Santa Fe suffered from oversupply in the late 2010s, but the market has stabilized. It remains the primary hub for multinational business, ensuring a steady stream of corporate tenants for luxury apartments.",
      "challenge": "The 'Asociación de Colonos' (HOA) acts as a shadow government. Their approval is essential.",
      "solution": "We have deep experience navigating the bureaucracy of the Santa Fe Colonos.",
      "focus_areas": ["Corporate Interiors", "Penthouse Design", "Commercial Fit-outs"],
      "zoning_authority": "Cuajimalpa & Colonos",
      "permit_timeline": "2-4 Months",
      "cost_per_sqm": "$1,500 - $3,000 USD",
      "best_streets": ["Avenida Santa Fe", "Prolongación Reforma"],
      "hidden_gems": "Apartments facing La Mexicana Park.",
      "investor_tip": "Buy 'Shell' (Obra Gris) apartments. Finishing them to a high standard offers better margins than buying finished units.",
      "common_project_type": "Interior fit-out of a luxury high-rise apartment delivered in 'shell' condition.",
      "nearby": [
        {"name": "Lomas de Chapultepec", "slug": "lomas-de-chapultepec"}
      ]
    },
    {
      "name": "Juárez",
      "slug": "juarez",
      "vibe": "The Phoenix. A former aristocratic glory rising from the ashes to become the edgiest neighborhood.",
      "lifestyle_vibe": "Juárez is eclectic. You have the Korean community, heavy metal bars, and ultra-luxury hotels all in one zone. It feels urban, gritty, and exciting. It attracts a crowd that finds Roma too polished. It is the home of 'Little Tokyo' and the Korean community, giving it a unique international flavor. The vibe is raw, urban, and exciting. It feels like a neighborhood on the verge of superstardom. You can find the best Korean BBQ in the city next to a 100-year-old French mansion that is being converted into a co-working space. It borders the financial district on Reforma, making it incredibly convenient for young professionals.",
      "history": "In the late 1800s, this was the neighborhood for the wealthy. It was abandoned in the mid-century and became the 'Zona Rosa'. Today, it is being restored. The architecture is a fascinating mix of Porfirian mansions (many in disrepair but beautiful) and mid-century apartment blocks. The 'Zona Rosa' section became famous as a nightlife and LGBTQ+ hub in the 70s and 80s.",
      "landmarks": "The Angel of Independence, Chocolate Museum.",
      "best_coffee": "Farmacia Internacional.",
      "dining_scene": "Incredible Korean BBQ mixed with high-end spots like Niddo.",
      "quirks": "The 'Zona Rosa' nightlife district is loud, while blocks away are quiet residential streets.",
      "investment_outlook": "Aggressive growth. Prices have doubled in 5 years but are still lower than Roma. Best for appreciation. It is currently the highest-ROI zone for renovation projects. The location is unbeatable—bordering both the historic center and the modern business district. As gentrification spills over from Roma, Juárez is the direct beneficiary.",
      "challenge": "Structural risk. Many 1900s mansions were damaged in earthquakes.",
      "solution": "We partner with top structural engineers to ensure every renovation meets 2026 seismic codes.",
      "focus_areas": ["Investment Properties", "Structural Retrofit", "Boutique Hotels"],
      "zoning_authority": "SEDUVI",
      "permit_timeline": "4-6 Months",
      "cost_per_sqm": "$1,600 - $2,800 USD",
      "best_streets": ["Versalles", "Marsella", "Havre"],
      "hidden_gems": "The blocks closer to Bucareli.",
      "investor_tip": "Boutique Hotels and Airbnbs are the killer app here due to proximity to Reforma.",
      "common_project_type": "Restoring a French-style mansion into a mixed-use commercial/residential complex.",
      "nearby": [
        {"name": "Roma Norte", "slug": "roma-norte"},
        {"name": "Condesa", "slug": "condesa"}
      ]
    },
    {
      "name": "Coyoacán",
      "slug": "coyoacan",
      "vibe": "A colonial village trapped in time. Intellectual, colorful, and deeply Mexican.",
      "lifestyle_vibe": "Living in Coyoacán feels like living in a small province. The pace is slower. It attracts academics, artists, and families who want a garden and a connection to history. Weekends are dedicated to culture: browsing the book market, visiting the Blue House (Frida Kahlo), or walking in the Viveros (nurseries). It is less about 'scene' and more about 'community.' The air feels cleaner here, thanks to the abundance of trees and the Viveros park. It is a place for intellectuals and those who appreciate the 'Slow Life.' You don't move to Coyoacán for the nightlife; you move here for the Sunday morning coffee and the vibrant colors of the colonial architecture.",
      "history": "Coyoacán predates Mexico City. It was the headquarters of Hernán Cortés. It retains its original cobblestone streets. For centuries it was a separate village, only absorbed by the urban sprawl in the 20th century. This separation preserved its distinct character and layout. It has always been a haven for artists and revolutionaries—Frida Kahlo, Diego Rivera, Leon Trotsky all called it home. Walking its streets feels like walking through a history book.",
      "landmarks": "Frida Kahlo Museum, Coyoacán Market, Plaza Hidalgo.",
      "best_coffee": "Café El Jarocho or Café Avellaneda.",
      "dining_scene": "Traditional Mexican comfort food, churros, and growing gourmet options.",
      "quirks": "Traffic lights are rare in the historic center.",
      "investment_outlook": "A heritage asset. Coyoacán is a long-term hold. The value comes from the scarcity of colonial homes. They simply aren't making any more of them. It is a stable, high-value market driven by lifestyle buyers rather than speculators. While it may not see the explosive growth of Juárez, it will never lose its appeal. It is the 'Oxford' or 'Cambridge' of Mexico City.",
      "challenge": "INAH (National Institute of Anthropology and History) controls everything in the historic zone.",
      "solution": "We know how to modernize a colonial home's systems without disturbing the protected historic fabric.",
      "focus_areas": ["Colonial Renovations", "Garden Design", "Hacienda Styling"],
      "zoning_authority": "INAH (Strict)",
      "permit_timeline": "8-12 Months",
      "cost_per_sqm": "$1,800 - $3,200 USD",
      "best_streets": ["Francisco Sosa", "Tres Cruces"],
      "hidden_gems": "Barrio de Santa Catarina.",
      "investor_tip": "The Garden is the Value. Buyers pay a premium for lush, well-designed internal courtyards.",
      "common_project_type": "Sensitive restoration of an 18th or 19th-century Casona.",
      "nearby": [
        {"name": "Del Valle", "slug": "del-valle"}
      ]
    },
    {
      "name": "Del Valle",
      "slug": "del-valle",
      "vibe": "The pragmatic heart of the city. Safe, central, green, and highly livable.",
      "lifestyle_vibe": "Del Valle is the '15-minute city' realized. Everything you need is within walking distance. It is less pretentious than Polanco and less chaotic than Roma. It's the preferred choice for families who want safety and space without the Lomas price tag. It boasts some of the best parks in the city (Parque de los Venados, Parque Arboledas) which are always full of children and dogs. The housing stock is mostly vertical—high-quality apartments built in the 70s, 80s, and 90s. It is not 'trendy' in the Instagram sense, but it is incredibly functional. It has excellent public transport connectivity and is generally considered one of the safest zones in the central city.",
      "history": "Developed in the mid-20th century, it has a mix of functionalist houses and 1980s apartment blocks. It was originally a zone of country houses and orchards, which explains the width of its avenues and the abundance of trees. It experienced rapid verticalization in the late 20th century, becoming the quintessential middle-class neighborhood of CDMX.",
      "landmarks": "Parque de los Venados, Polyforum Siqueiros, Pepsi Center.",
      "best_coffee": "Passmar in Mercado Lazaro Cardenas.",
      "dining_scene": "Neighborhood favorites. Steakhouses, fondas, and solid international options.",
      "quirks": "It is geographically the center of CDMX.",
      "investment_outlook": "High liquidity. Del Valle apartments sell and rent very fast. It is a volume game. Because it is so central and livable, there is a constant stream of demand from professionals and young families. It is a low-risk, medium-return market. The opportunity lies in renovation—buying tired 1980s apartments and updating them for the modern market.",
      "challenge": "Construction Logistics. Most projects are in active apartment buildings.",
      "solution": "We excel at 'Neighbor Diplomacy' to minimize friction with HOAs.",
      "focus_areas": ["Apartment Remodels", "Kitchen Renovations", "Layout Modernization"],
      "zoning_authority": "Benito Juárez",
      "permit_timeline": "1-3 Months",
      "cost_per_sqm": "$1,000 - $2,000 USD",
      "best_streets": ["Adolfo Prieto", "Pilares"],
      "hidden_gems": "Del Valle Sur.",
      "investor_tip": "The 'Flipping' Sweet Spot. Buy a dated 1990s apartment and do a cosmetic update for a reliable margin.",
      "common_project_type": "Modernizing a 3-bedroom, 2-bath apartment for a young family.",
      "nearby": [
        {"name": "Narvarte", "slug": "narvarte"},
        {"name": "Roma Sur", "slug": "roma-sur"},
        {"name": "Coyoacán", "slug": "coyoacan"}
      ]
    },
    {
      "name": "Narvarte",
      "slug": "narvarte",
      "vibe": "Retro-cool, unpretentious, and community-driven. The new favorite for creatives.",
      "lifestyle_vibe": "Narvarte feels like a 1950s time capsule. Wide streets with palm trees and a relaxed pace. It has the best street food scene in the city. It is attracting the creative spillover from Roma/Condesa. It's hip without trying too hard. The residents are a diverse mix of old-timers, young creatives, and families. It feels more 'Mexican' and less 'International' than Roma, which is part of its charm. The street life is vibrant, with taco stands, cafes, and cantinas active until late. It offers a high quality of life at a price point that is still accessible compared to its western neighbors.",
      "history": "Developed in the 1940s and 50s, Narvarte is a museum of 'Functionalist' and 'Streamline Moderne' architecture. You see rounded corners, nautical windows, and mosaic details everywhere. It was designed as a modern residential zone for the mid-century middle class, and it has retained that character remarkably well.",
      "landmarks": "Glorieta de la Palma, The Taco Scene.",
      "best_coffee": "Alma Negra.",
      "dining_scene": "Taquerías. Narvarte is the spiritual home of the 'Taco al Pastor'.",
      "quirks": "The architecture is 'Streamline Moderne'—rounded corners and nautical windows.",
      "investment_outlook": "Rising star. Prices are catching up to Del Valle but offer more 'character.' It is a prime target for renovation-focused investors. The stock of mid-century apartments is high, and the market for restored vintage units is booming. It is following the exact trajectory of Roma Sur 5 years ago.",
      "challenge": "Aging Infrastructure. 70-year-old plumbing and wiring are standard risks.",
      "solution": "We always recommend a full systems replacement in Narvarte renovations.",
      "focus_areas": ["Mid-Century Restoration", "Systems Overhaul", "Functionalist Design"],
      "zoning_authority": "Benito Juárez",
      "permit_timeline": "1-3 Months",
      "cost_per_sqm": "$900 - $1,800 USD",
      "best_streets": ["Cumbres de Maltrata", "Vertiz"],
      "hidden_gems": "Narvarte Oriente.",
      "investor_tip": "Preservation pays. Restore the terrazzo floors and vintage details.",
      "common_project_type": "Restoring a mid-century apartment, keeping the vintage aesthetic but upgrading all systems.",
      "nearby": [
        {"name": "Del Valle", "slug": "del-valle"},
        {"name": "Roma Sur", "slug": "roma-sur"}
      ]
    }
  ]
}